[
    {"name":"BATMAN - KNIGHTWATCH #8","description":"Scarecrow’s haunted house in Amusement Mile turns out to be a trap for the Batman Family.","image":"https://www.dccomics.com/sites/default/files/styles/covers192x291/public/comic-covers/2021/12/BM_KW_CH8_61a91b1edae206.56489072.jpg?itok=txFSUxMW","price":1.99},
    {"name":"SUPERMAN: SON OF KAL-EL 2021 ANNUAL #1","description":"Jon Kent’s first days as Earth’s new Superman have been a trial by fire. His actions have already put those he loves in harm’s way. He has stood strong in the path of constant attacks, but the immovable object is about to meet an unstoppable force. Lex Luthor—the man, the myth, the menace—returns to Metropolis.","image":"https://www.dccomics.com/sites/default/files/styles/covers192x291/public/comic-covers/2021/11/SMSOKE2021_Cv1_618410981b59e1.64842509_61841a9727c388.64438363.jpg?itok=u1tW7PHn","price":5.99},
    {"name":"BATMAN: URBAN LEGENDS VOL. 1","description":"Two of Gotham City's edgiest heroes, Red Hood and Grifter, cross paths with Batman himself in this collection of stories from the new anthology series Batman: Urban Legends. Two top comics writers, Matthew Rosenberg and Chip Zdarsky, enter the world of Gotham City with new tales of Batman, Red Hood, and Grifter in the first volume collecting stories from the thrilling new anthology series Batman: Urban Legends. First, writer Chip Zdarsky and artist Eddy Barrows chronicle Red Hood's investigation of a new drug in Gotham City called Cheerdrops. But this night will NOT go as planned--and as a result, he will end up back in Batman's crosshairs! Then, writer Matthew Rosenberg joins forces with artist Ryan Benjamin for a new tale of Cole Cash--better known as Grifter. Picking up story points from recent Batman issues, readers will learn why Cole is in Gotham to begin with. Plus, discover the truth about the mysterious organization known as HALO, and witness round two of Batman versus Grifter. This title collects stories from Batman: Urban Legends #1-6.","image":"https://www.dccomics.com/sites/default/files/styles/covers192x291/public/gn-covers/2021/12/BMUL_v1%20BB%20%28Cover%29_61a918d9ee30e6.57537611.jpg?itok=0K9p5MNC","price":24.99},
    {"name":"DEATHSTROKE INC. #4","description":"DEATHSTROKE VS. BLACK CANARY! Now that they know the truth about the secretive T.R.U.S.T. organization, Black Canary and Deathstroke are at odds over what to do about it. But before they can set aside their hatred for each other, they are attacked by an army of the DC Universe’s deadliest villains!","image":"https://www.dccomics.com/sites/default/files/styles/covers192x291/public/comic-covers/2021/12/DSKINC_Cv4_00411_DIGITAL_61aac6c43563e8.32073023.jpg?itok=StBFp9vN","price":3.99},
    {"name":"DETECTIVE COMICS #1046","description":"“Fear State” aftermath! Bloody, broken, and beaten…Batman had a mission after The Joker War. He would no longer look over Gotham City from Wayne Manor; he would move to the heart of the city, get closer to its people and its problems. The fight he pursued would be different, but after Fear State he finds himself disillusioned. He is no longer the protector the city needs, and definitely not the one it deserves. Batman’s last night in Gotham City before his international sojourn is here. Backup: Harley Quinn guest-stars in the culmination of “Foundations”! Must Gotham City have an Arkham facility, and if so…will it be any different, or is doom on its way?","image":"https://www.dccomics.com/sites/default/files/styles/covers192x291/public/comic-covers/2021/12/DTC_Cv1046_04611_DIGITAL_61aac6cc599853.03175299.jpg?itok=37C9PtTR","price":4.99},
    {"name":"THE BATMAN & SCOOBY-DOO MYSTERIES #9","description":"G-g-ghosts? P-p-pirates? What’s a team of daring (and not-so-daring!) detectives to do when a buried treasure takes center stage in one of the Riddler’s latest schemes? Why, they’ll crack the case before he cracks the safe, or they’ll walk the plank, me hearties!","image":"https://www.dccomics.com/sites/default/files/styles/covers192x291/public/comic-covers/2021/12/BMSCOOBY_Cv9_00911_DIGITAL_61aac30324c147.21954743.jpg?itok=U9O0gDD4","price":4.99},
    {"name":"TITANS UNITED #4","description":"Variant CoveStarfire takes on Lady Vic as more super-powered sleeper agents activate, displaying powers far beyond those of the Titans. Just who is behind the Cadmus experiment, and what is Blackfire planning as she brings Superboy to his knees?","image":"https://www.dccomics.com/sites/default/files/styles/covers192x291/public/comic-covers/2021/12/TNSU_Cv4_00411_DIGITAL_61aac32abeff20.97428947.jpg?itok=z7JxRcWV","price":3.99},
    {"name":"BATMAN: URBAN LEGENDS #10","description":"Tim Drake goes to make peace with Batman before he leaves Gotham. Superstar writer Tini Howard makes her DC debut on a Nightwing, Oracle, and Batgirls holiday spectacular. Azrael faces down the new villain THE POOR FELLOW. And Tweedle Dum has to make a grave decision.","image":"https://www.dccomics.com/sites/default/files/styles/covers192x291/public/comic-covers/2021/12/BMUL_Cv10_01011_DIGITAL-1_61aac1fc918ef4.93132475.jpg?itok=blpDCG2U","price":7.99}
]