[
    {
        "name": "Hawkeye: Kate Bishop (2021) #2",
        "description": "\n                                    Before Kate can fully wrap her head around the fact that her estranged sister Susan has reappeared (what?) and was the one who invited her to Resort Chapiteau in the first place (what?!) and that this case is definitely not going to allow much in the way of pool time (ughhh), she gets pulled into something she does know how to handle: a little girl staying at the resort has gone missing. But in spite of the fact that she’s basically an Avenger, the resort staff don’t want her investigating.  So now Kate has three mysteries on her hands: Where is the girl, what is the resort hiding – and what does this have to do with her family in the first place?\n                            \n                        \t\n                        ",
        "image": "https://i.annihil.us/u/prod/marvel/i/mg/5/d0/61a92d24612cc/portrait_uncanny.jpg",
        "price": 4
    },
    {
        "name": "Avengers Forever (2021) #1",
        "description": "\n                                    AN ALL-NEW SERIES STARRING THE AVENGERS OF THE MULTIVERSE! On a quest for cosmic vengeance, Ghost Rider finds himself roaring through the wasteland on a ruined Earth, where the great age of heroes never came to be, where hope is a four-letter word and where his only ally in the coming battle against the greatest villains any universe has ever seen is the world’s most wanted archaeologist, Tony Stark…the Invincible Ant-Man. Spinning out of the cataclysmic events of AVENGERS #750 and operating in lockstep with the prime AVENGERS series, the next great Avengers saga begins here, as the Mightiest Heroes of every Earth begin to assemble.\n                            \n                        \t\n                        ",
        "image": "https://i.annihil.us/u/prod/marvel/i/mg/2/40/61ae1ce6bfdb9/portrait_uncanny.jpg",
        "price": 7
    },
    {
        "name": "Ms. Marvel: Beyond the Limit (2021) #1",
        "description": "\n                                    MS. MARVEL RETURNS IN A NEW STORY FROM BEST-SELLING AUTHOR SAMIRA AHMED! While on a break visiting her cousin in Chicago, Kamala Khan stumbles upon a robbery at a university physics lab . . . and maybe sets off an explosion of interdimensional proportions in the process. Still, nothing she can't handle. Or so she thinks, until she gets home and finds her whole world turned upside down . . .and into a Bollywood set?! Why is everyone she knows singing, and how can she make it stop?\n                            \n                        \t\n                        ",
        "image": "https://i.annihil.us/u/prod/marvel/i/mg/c/10/61ae1ef873c1a/portrait_uncanny.jpg",
        "price": 6
    },
    {
        "name": "The Darkhold: Spider-Man (2021) #1",
        "description": "\n                                    THE SPIDER TRAPPED IN A WEB OF HIS OWN MAKING! After reading from the ancient Darkhold, Spider-Man was meant to gain the power to enter the dread Chthon’s dimension and stop him from spreading his mythic darkness across the globe. Instead the book drove him insane – but what does that mean for the stalwart Peter Parker? Dive into a warped world of Spider-Man’s broken mind!\n                            \n                        \t\n                        ",
        "image": "https://i.annihil.us/u/prod/marvel/i/mg/3/a0/61a92d267d069/portrait_uncanny.jpg",
        "price": 9
    },
    {
        "name": "Hawkeye & Mockingbird (2010)Hawkeye & Mockingbird (2010)",
        "description": "\n                                    Meet the Mr. & Mrs. Smith of the Marvel Universe! Hawkeye, the world's greatest marksman, is back in action with the world's most dangerous super-spy, Mockingbird, as one of the most popular pairs ...\n                            \n                        \tmore\n                        ",
        "image": "https://i.annihil.us/u/prod/marvel/i/mg/c/d0/4ba945f9d4ab9/standard_incredible.jpg",
        "price": 1
    },
    {
        "name": "Shang-Chi (2021) #5",
        "description": "\n                                    MEET THE NEW IRON MAN...SHANG-CHI?! A weapons dealer offers up a stolen Iron Man suit to Shang-Chi's organization. But will Shang-Chi take it to use in his war against crime? And what will Tony Stark have to say about it?!\n                            \n                        \t\n                        ",
        "image": "https://i.annihil.us/u/prod/marvel/i/mg/9/20/6160b671cb3ff/portrait_uncanny.jpg",
        "price": 6
    },
    {
        "name": "Death Of Doctor Strange: Avengers (2021) #1",
        "description": "\n                                    EARTH'S WEAKEST HEROES! With Doctor Strange gone, the Avengers are the only ones who can stop a rampaging Juggernaut-like monster from wrecking all of Manhattan! But what does this mystical creature want? And how does the magic-skeptical Iron Man hold the answer?\n                            \n                        \t\n                        ",
        "image": "https://i.annihil.us/u/prod/marvel/i/mg/2/50/6169eeeb0aecd/portrait_uncanny.jpg",
        "price": 4
    },
    {
        "name": "X-Men: The Trial of Magneto (2021) #5",
        "description": "\n                                    JUSTICE IS SERVED. The mystery surrounding Magneto and Scarlet Witch is resolved. The guilty will be judged, the innocent absolved, the victims avenged…and all shall endure their own trials.\n                            \n                        \t\n                        ",
        "image": "https://i.annihil.us/u/prod/marvel/i/mg/1/70/61ae1cae4a4cc/portrait_uncanny.jpg",
        "price": 8
    }
]